app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "price") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
	def create
		@article = Article.new(article_params)
		@article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
UPDATE "articles" SET "title" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["title", "Patta x Mitchell & Ness Mesh Longsleeve Hockey Jersey"], ["updated_at", "2019-03-04 21:02:10.494453"], ["id", 3]]
---
	def update
		@article = Article.find(params[:id])
		@article.update(article_params)