app/controllers/tags_controller.rb

	def show
		@tag = Tag.find_by(name: params[:name])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "14"], ["LIMIT", 1]]