app/models/article.rb

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "accessories"], ["created_at", "2019-03-03 00:39:02.869599"], ["updated_at", "2019-03-03 00:39:02.869599"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "outerwear"], ["LIMIT", 1]]
---
	def tag_list=(tags_string)
		tag_names = tags_string.split(",").collect{|s| s.strip.downcase}.uniq
		new_or_found_tags = tag_names.collect { |name| Tag.find_or_create_by(name: name) }